<a href="https://colab.research.google.com/github/Leonard-Boante-Mensah/Pandas_Assignment/blob/main/THIS_IS_JEORPARDY.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
from google.colab import drive
drive.mount('/content/drive')

Mounted at /content/drive

In [13]:
import pandas as pd
import numpy as np
from matplotlib import pyplot as plt
import seaborn as sns
pd.set_option('display.max_colwidth', -1)

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:5: FutureWarning: Passing a negative integer is deprecated in version 1.0 and will not be supported in future version. Instead, use None to not limit the column width.
  """

In [4]:
data = pd.read_csv('/content/drive/MyDrive/MY PROJECT DATASETS/jeopardy_starting/jeopardy_starting/jeopardy.csv')
data.head()

   Show Number  ...      Answer
0         4680  ...  Copernicus
1         4680  ...  Jim Thorpe
2         4680  ...     Arizona
3         4680  ...  McDonald's
4         4680  ...  John Adams

[5 rows x 7 columns]

In [7]:
data.columns

Index(['Show Number', ' Air Date', ' Round', ' Category', ' Value',
       ' Question', ' Answer'],
      dtype='object')

In [10]:
data.columns = ['show_number', 'air_date', 'round', 'category', 'value', 'question', 'answer']

In [11]:
data.head()

   show_number  ...      answer
0         4680  ...  Copernicus
1         4680  ...  Jim Thorpe
2         4680  ...     Arizona
3         4680  ...  McDonald's
4         4680  ...  John Adams

[5 rows x 7 columns]

In [14]:
data.question

0         For the last 8 years of his life, Galileo was under house arrest for espousing this man's theory
1         No. 2: 1912 Olympian; football star at Carlisle Indian School; 6 MLB seasons with the Reds, Giants & Braves
2         The city of Yuma in this state has a record average of 4,055 hours of sunshine each year
3         In 1963, live on "The Art Linkletter Show", this company served its billionth burger
4         Signer of the Dec. of Indep., framer of the Constitution of Mass., second President of the United States
                                                            ...
216925    This Puccini opera turns on the solution to 3 riddles posed by the heroine
216926    In North America this term is properly applied to only 4 species that are crested, including the tufted
216927    In Penny Lane, where this "Hellraiser" grew up, the barber shaves another customer--then flays him alive!
216928    From Ft. Sill, Okla. he made the plea, Arizona is my land, my home, my father's land, to which I now ask to... return"
216929    A silent movie title includes the last name of this 18th c. statesman & favorite of Catherine the Great
Name: question, Length: 216930, dtype: object

In [15]:
data.category

0         HISTORY
1         ESPN's TOP 10 ALL-TIME ATHLETES
2         EVERYBODY TALKS ABOUT IT...
3         THE COMPANY LINE
4         EPITAPHS & TRIBUTES
                 ...
216925    RIDDLE ME THIS
216926    "T" BIRDS
216927    AUTHORS IN THEIR YOUTH
216928    QUOTATIONS
216929    HISTORIC NAMES
Name: category, Length: 216930, dtype: object

In [16]:
data.value

0         $200
1         $200
2         $200
3         $200
4         $200
          ...
216925    $2000
216926    $2000
216927    $2000
216928    $2000
216929    None
Name: value, Length: 216930, dtype: object

In [17]:
data.air_date

0         2004-12-31
1         2004-12-31
2         2004-12-31
3         2004-12-31
4         2004-12-31
             ...
216925    2006-05-11
216926    2006-05-11
216927    2006-05-11
216928    2006-05-11
216929    2006-05-11
Name: air_date, Length: 216930, dtype: object

In [29]:
search_list = ['King', 'england']

question_3 = data[data.question.apply(lambda x: all(word.lower() in x.lower() for word in search_list))]
question_3.shape

(152, 7)

In [30]:
question_3

        show_number  ...                        answer
4953    3003         ...  Philately (stamp collecting)
6337    3517         ...  Ethelred
9191    3907         ...  Henry V
11710   2903         ...  James I
13454   4726         ...  4
...      ...         ... ..
208295  4621         ...  William the Conqueror
208742  4863         ...  William of Orange roughy
213870  5856         ...  George III
216021  1881         ...  Edward VII
216789  5070         ...  Wessex

[152 rows x 7 columns]

In [37]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 216930 entries, 0 to 216929
Data columns (total 7 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   show_number  216930 non-null  int64
 1   air_date     216930 non-null  object
 2   round        216930 non-null  object
 3   category     216930 non-null  object
 4   value        216930 non-null  object
 5   question     216930 non-null  object
 6   answer       216928 non-null  object
dtypes: int64(1), object(6)
memory usage: 11.6+ MB

In [38]:
data.isnull().any()

show_number    False
air_date       False
round          False
category       False
value          False
question       False
answer         True
dtype: bool

In [45]:
data['value'] = data['value'].str.replace('$',' ')

In [53]:
data['value'] = data['value'].str.replace(',', '')

In [42]:
data.value.head()

0     200
1     200
2     200
3     200
4     200
Name: value, dtype: object

In [54]:
data['value'] = pd.to_numeric(data['value'], errors='coerce')

In [55]:
data = data.replace(np.nan, 0, regex=True)

In [56]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 216930 entries, 0 to 216929
Data columns (total 7 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   show_number  216930 non-null  int64
 1   air_date     216930 non-null  object
 2   round        216930 non-null  object
 3   category     216930 non-null  object
 4   value        216930 non-null  float64
 5   question     216930 non-null  object
 6   answer       216930 non-null  object
dtypes: float64(1), int64(1), object(5)
memory usage: 11.6+ MB

In [57]:
search_list = ['King']

question_4 = data[data.question.apply(lambda x: all(word.lower() in x.lower() for word in search_list))]
question_4.value.mean()

771.8833850722094

In [60]:
def filter_function(data):
  return data[data.question.apply(lambda x: all(word.lower() in x.lower() for word in search_list))]

In [58]:
def word_answer_counts(data):
  return data.answer.value_counts()

In [59]:
print(word_answer_counts(question_4))

Henry VIII             55
Solomon                35
Richard III            33
Louis XIV              31
David                  30
                       ..
Jay Leno               1
Sir John Falstaff      1
the continents         1
short-order cook       1
Pigs' Feet/Knuckles    1
Name: answer, Length: 5268, dtype: int64